---
kind: property
id: P:Autodesk.Revit.DB.ScheduleFieldId.IntegerValue
source: html/d29ba147-d91e-877e-e4c5-7b892d657ecd.htm
---
# Autodesk.Revit.DB.ScheduleFieldId.IntegerValue Property

Provides the value of the ScheduleFieldId as an integer.

## Syntax (C#)
```csharp
public int IntegerValue { get; }
```